erpdev.СХК_Расширение/src/DataProcessors/СХК_МобильныйСкладСырье/СХК_МобильныйСкладСырье.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СХК_МобильныйСкладСырье</name>
  <attributes>
    <name>Склад</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокГодности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабПриемка</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтихКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСобрано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

erpdev.СХК_Расширение/src/Enums/СпособыДоставки/СпособыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СпособыДоставки</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>СиламиПеревозчикаПоАдресу</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ДоКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Самовывоз</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СиламиПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КПолучателюОпределяетСлужбаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СиламиПоставщикаДоНашегоСклада</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НашимиСиламиСАдресаОтправителя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СиламиПеревозчикаДоПунктаПередачи</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СиламиПеревозчикаДоНашегоСклада</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтОтправителяОпределяетСлужбаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

erpdev.СХК_Расширение/src/Enums/ТипыНалогообложенияНДС/ТипыНалогообложенияНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыНалогообложенияНДС</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ПродажаНеОблагаетсяНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПродажаОблагаетсяНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПродажаНаЭкспорт</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПродажаОблагаетсяЕНВД</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="c0a070a8-fff5-49fe-8c9e-3fbae30394cb">
    <name>НалоговыйАгентПоНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e8352fa6-99c0-4f4b-9227-b1ac7d158a3e">
    <name>ОблагаетсяНДСУПокупателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

erpdev.СХК_Расширение/src/Documents/ПриходныйОрдерНаТовары/ПриходныйОрдерНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="6a90e124-5af0-4a37-8ff7-14481b8cb2dd">
  <name>ПриходныйОрдерНаТовары</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="5dcdee8c-9444-4bd3-ae94-e55f618ed216">
    <name>Распоряжение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5a3dfe1b-75d0-4247-8d64-84bab203cf9c">
    <name>Отправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bbce78e7-d91d-4dac-8a0c-b47e64d9325b">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9cd3d95f-95cb-4f59-909e-802e5579ac5b">
    <name>ДатаВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="8762c46f-68da-4109-a1f4-fb201e69cf69">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f481b21a-9531-4e52-9957-c494f5e377f6">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0c0f355e-967b-4aef-9cf3-b95cc9fdfcef">
    <name>НомерВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d0368be3-8269-42f8-b1e8-5a902ab8fbd0">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="95326fc6-5780-440a-84af-cd29440e2b58">
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ca8589c8-0a63-4506-aa59-5684f62c08c1">
    <name>ЗонаПриемки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8a679cf3-b805-4f49-bee6-d93a2702e946">
    <name>СкладскаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b49b6320-3833-4d7e-9256-844ccbfa090e">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="06e8c720-eb9f-425a-9716-baef1a36e9a3">
    <name>Исполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0cdca97b-7d3f-41b0-a49d-95b6449dd7ac">
    <name>РежимПросмотраПоТоварам</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="efa8b93c-791b-4449-99fd-217a3baf3df6">
    <name>ВсегоМест</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="4c33a3ea-7a9b-4d40-8f7d-a7581e73da16">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="91453e18-03ae-4724-8a0e-3401542ee57a">
      <name>ДокументОтгрузки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="75e84f0f-f847-4153-b485-7a92a831f94b">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="dfa19489-ad65-49e8-bcaa-38abf251ab1a">
      <name>УпаковочныйЛистРодитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="193cb4c0-81db-49ab-a130-d34f2a776519">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="eeb10de4-4d97-4473-b2ac-e752ff3ab390">
      <name>Комментарий</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="9dd9c28c-0ab6-479c-907f-118c9feac29e">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fa78140c-0253-4803-87da-cf38870a1ab3">
      <name>Штрихкод</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>200</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="8496f61d-538d-4d21-80c3-b273a1617696">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="55fb4905-a811-46e2-9192-771e2fb958cc">
      <name>УпаковочныйЛист</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="75fac7f0-d3fd-4458-a727-7598962ea772">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1f572790-edb3-4f4d-b716-aac43eeb7c85">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f4b9edd5-b41d-4b6b-86c5-b4d3896e8b32">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="608ab205-e85c-4c0c-bb0a-19c0fcca2cd5">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

erpdev.СХК_Расширение/src/Documents/ПриобретениеТоваровУслуг/ПриобретениеТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПриобретениеТоваровУслуг</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f3631163-ecf9-4949-af6b-b3c894a40c91">
    <name>ДопоступлениеПоДокументу</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5a272903-ac15-4c54-83f5-b82f1b6b646d">
    <name>ЗаказПоставщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="941aa10e-3657-48ec-8f9d-92e38e90ecbf">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="8838bcd9-5b8b-43a2-af1e-aa9708955035">
      <name>АналитикаРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="422786fa-18ea-4f26-8dd6-4a588060e399">
      <name>ЗаказПоставщику</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="2a1df39c-cbfc-404b-9562-a5843f5ff91e">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="fe8e86bc-a667-4a44-bce5-642d9aeae84c">
    <name>РасшифровкаПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="0cc415ea-d44d-4d76-bb55-6a68970d24dd">
      <name>ОбъектРасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

erpdev.СХК_Расширение/src/DataProcessors/СХК_МобильныйСкладСырье/Forms/ФормаЗаказа/Module.bsl
&НаКлиенте
Процедура ТоварыВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;  
	
	Если Элемент.ТекущиеДанные.КоличествоУпаковокПринято > 0 И Элемент.ТекущиеДанные.КоличествоУпаковокПринято <> Элемент.ТекущиеДанные.КоличествоУпаковок Тогда
		ВывестиВопрос(Элемент.ТекущиеДанные);	
	Иначе
		ПараметрыФормыОстатки = Новый Структура;
		ПараметрыФормыОстатки.Вставить("ЗаказПоставщику",ЭтотОбъект.ДокументЗаказПоставщику);
		СтруктураСтрока = Новый Структура("Номенклатура,Упаковка,КоличествоУпаковок,КоличествоУпаковокПринято,СерииНоменклатуры");
		ЗаполнитьЗначенияСвойств(СтруктураСтрока, Элемент.ТекущиеДанные);	 
		ПараметрыФормыОстатки.Вставить("СтрокаЗаказПоставщику",СтруктураСтрока);
		АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
		_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
		//@skip-check notify-description-to-server-procedure
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыЗаказПоставщика", ЭтаФорма);
		ОткрытьФорму("Обработка.СХК_МобильныйСкладСырье.Форма.ФормаПоступления", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте 
Процедура ВывестиВопрос(Данные)
	
	//@skip-check undefined-function
	Ответ = Вопрос("Добавить позицию?",
	РежимДиалогаВопрос.ДаНет,
	0, // таймаут в секундах
	КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
	"Добавить позицию?" // (необ.) заголовок
	//"По данному ордеру все собрано !!!"
	);
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПараметрыФормыОстатки = Новый Структура;
		ПараметрыФормыОстатки.Вставить("ЗаказПоставщику",ЭтотОбъект.ДокументЗаказПоставщику);
		СтруктураСтрока = Новый Структура("Номенклатура,Упаковка,КоличествоУпаковок,КоличествоУпаковокПринято,СерииНоменклатуры");
		ЗаполнитьЗначенияСвойств(СтруктураСтрока, Данные);
		СтруктураСтрока.Вставить("СерииНоменклатуры","");
		СтруктураСтрока.Вставить("КоличествоУпаковокПринято",0);
		ПараметрыФормыОстатки.Вставить("СтрокаЗаказПоставщику",СтруктураСтрока);
		АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
		_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
		//@skip-check notify-description-to-server-procedure
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыЗаказПоставщика", ЭтаФорма);
		ОткрытьФорму("Обработка.СХК_МобильныйСкладСырье.Форма.ФормаПоступления", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс); 
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
		ПараметрыФормыОстатки = Новый Структура;
		ПараметрыФормыОстатки.Вставить("ЗаказПоставщику",ЭтотОбъект.ДокументЗаказПоставщику);
		СтруктураСтрока = Новый Структура("Номенклатура,Упаковка,КоличествоУпаковок,КоличествоУпаковокПринято,СерииНоменклатуры");
		ЗаполнитьЗначенияСвойств(СтруктураСтрока, Данные );	 
		ПараметрыФормыОстатки.Вставить("СтрокаЗаказПоставщику",СтруктураСтрока);
		АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
		_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
		//@skip-check notify-description-to-server-procedure
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыЗаказПоставщика", ЭтаФорма);
		ОткрытьФорму("Обработка.СХК_МобильныйСкладСырье.Форма.ФормаПоступления", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;
	
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработатьЗакрытиеФормыЗаказПоставщика(Значение, ДопПараметры) Экспорт
	ЗаполнитьТабЧасть()	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.Адрес);


	Если СтруктураПараметров.ЗаказПоставщику <> "" Тогда
		ЭтотОбъект.ДокументЗаказПоставщику = СтруктураПараметров.ЗаказПоставщику;
		ЗаполнитьТабЧасть();	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабЧасть()
	
	Товары.Очистить();
	Товары.Загрузить(ПолучитьДанныеПоЗаказу(ЭтотОбъект.ДокументЗаказПоставщику));
	

КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеПоЗаказу(Заказ)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
	|	ЗаказПоставщикуТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ЗаказПоставщикуТовары.Упаковка КАК Упаковка,
	|	ВложенныйЗапрос.Количество КАК КоличествоУпаковокПринято,
	|	ВложенныйЗапрос.Серия КАК СерииНоменклатуры,
	|	ВложенныйЗапрос.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ПриходныйОрдерНаТоварыТовары.Номенклатура КАК Номенклатура,
	|			ПриходныйОрдерНаТоварыТовары.Упаковка КАК Упаковка,
	|			ПриходныйОрдерНаТоварыТовары.Количество КАК Количество,
	|			ПриходныйОрдерНаТоварыТовары.Ссылка.Распоряжение КАК Распоряжение,
	|			ПриходныйОрдерНаТоварыТовары.Серия КАК Серия,
	|			ПриходныйОрдерНаТоварыТовары.Ссылка КАК Ссылка
	|		ИЗ
	|			Документ.ПриходныйОрдерНаТовары.Товары КАК ПриходныйОрдерНаТоварыТовары
	|		ГДЕ
	|			ПриходныйОрдерНаТоварыТовары.Ссылка.Проведен = ИСТИНА
	|			И ПриходныйОрдерНаТоварыТовары.Ссылка.ПометкаУдаления = ЛОЖЬ) КАК ВложенныйЗапрос
	|		ПО ЗаказПоставщикуТовары.Ссылка = ВложенныйЗапрос.Распоряжение
	|		И ЗаказПоставщикуТовары.Номенклатура = ВложенныйЗапрос.Номенклатура
	|ГДЕ
	|	ЗаказПоставщикуТовары.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",Заказ );
	Возврат Запрос.Выполнить().Выгрузить();	
КонецФункции

&НаКлиенте
Процедура Принять(Команда)
	Ош = ПринятьНаСервере();
	Если Ош = Ложь Тогда
		ЭтаФорма.Закрыть();
	Иначе
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждениеСохранения", ЭтотОбъект);	
		ПоказатьПредупреждение(Оповещение,Строка(Ош),5,"Внимание!!!");
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура ПослеЗакрытияПредупреждениеСохранения(Значение) Экспорт 
					
КонецПроцедуры


&НаСервере
Функция ПринятьНаСервере() 
	
	Ош = Истина;
	
	
	Если Не ПоискДокументаПоступления() Тогда  
		
		
		Таб = ЭтотОбъект.Товары.Выгрузить();
		ТабЗаказа = ЭтотОбъект.ДокументЗаказПоставщику.Товары.Выгрузить();
		Док = Документы.ПриобретениеТоваровУслуг.СоздатьДокумент(); 
		Док.Дата = ТекущаяДата(); 
		Док.ДатаПоступления = ТекущаяДата();
		Док.Партнер = ЭтотОбъект.ДокументЗаказПоставщику.Партнер;
		Док.Контрагент = ЭтотОбъект.ДокументЗаказПоставщику.Контрагент;
		Док.Организация = ЭтотОбъект.ДокументЗаказПоставщику.Организация;
		Док.Договор = ЭтотОбъект.ДокументЗаказПоставщику.Договор;
		Док.ЗаказПоставщику = ЭтотОбъект.ДокументЗаказПоставщику.Ссылка;
		Док.ВалютаВзаиморасчетов = ЭтотОбъект.ДокументЗаказПоставщику.Валюта;
		Док.Валюта =  ЭтотОбъект.ДокументЗаказПоставщику.Валюта; 
		Док.ЦенаВключаетНДС = ЭтотОбъект.ДокументЗаказПоставщику.ЦенаВключаетНДС;
		Док.ПоступлениеПоЗаказам = Истина;
		Док.Склад = ЭтотОбъект.ДокументЗаказПоставщику.Склад;
		Док.Соглашение = ЭтотОбъект.ДокументЗаказПоставщику.Соглашение;
		Док.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика;
		Док.Автор = Пользователи.АвторизованныйПользователь();
		Док.ЗакупкаПодДеятельность = ЭтотОбъект.ДокументЗаказПоставщику.ЗакупкаПодДеятельность;
		Док.НалогообложениеНДС = ЭтотОбъект.ДокументЗаказПоставщику.НалогообложениеНДС;;
        Док.ВариантПриемкиТоваров   = Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;
		Док.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз; 
		Для Каждого стр из Таб Цикл
			Отбор = Новый Структура;
			Отбор.Вставить("Номенклатура",стр.Номенклатура);
			Строки = ТабЗаказа.НайтиСтроки(Отбор);
			
			Если Строки.Количество()>=1 Тогда     
				Т = Док.Товары.Добавить();
				Т.Номенклатура = стр.Номенклатура;
				Т.Упаковка = стр.Номенклатура.ЕдиницаИзмерения;
				Т.КоличествоУпаковок = стр.КоличествоУпаковокПринято;
				Т.Количество = стр.КоличествоУпаковокПринято; 
				Т.Цена = Строки[0].Цена;
				//Т.Сумма = 
				Т.СтавкаНДС = Строки[0].СтавкаНДС;
				//Т.СуммаНДС = 
				//Т.СуммаСНДС = 
				Т.Склад = ЭтотОбъект.ДокументЗаказПоставщику.Склад ;
				Т.ЗаказПоставщику = ЭтотОбъект.ДокументЗаказПоставщику.Ссылка;
				//Т.СуммаВзаиморасчетов = 
				Если стр.СерииНоменклатуры <> Справочники.СерииНоменклатуры.ПустаяСсылка() Тогда
					Т.Серия = стр.СерииНоменклатуры;
					Т.СтатусУказанияСерий = 14;
				Иначе
					Т.СтатусУказанияСерий = 0;
				КонецЕсли;
			СтруктураПересчетаСуммы = Новый Структура;	
			Если Строки[0].СтавкаНДС <> Перечисления.СтавкиНДС.БезНДС Тогда
				СтруктураПересчетаСуммы.Вставить("НалогообложениеНДС", Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС);
				СтруктураПересчетаСуммы.Вставить("ЦенаВключаетНДС", Истина);
			Иначе
				СтруктураПересчетаСуммы.Вставить("НалогообложениеНДС", Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС);
				СтруктураПересчетаСуммы.Вставить("ЦенаВключаетНДС", Ложь);
				
			КонецЕсли;
			
									
 	СтруктураДействий = Новый Структура;  
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
	СтруктураДействий.Вставить("ОчиститьСуммуВзаиморасчетов");
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(Т, СтруктураДействий, Неопределено);

			Иначе
				Ош = "Товар отсутствует в заказе";
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
	Попытка	
		Док.Записать(РежимЗаписиДокумента.Проведение);             
		Ош = Ложь;

	Исключение
		Ош = "При проведении возникла ошибка, проведите в ручную";
	КонецПопытки;		
		
	Иначе
		Ош = "Уже существует документ, выполните приемку в ручную";
	КонецЕсли;		

	Возврат  Ош;
	
КонецФункции 

Функция ПоискДокументаПоступления()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПриходныйОрдерНаТовары.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ПриходныйОрдерНаТовары КАК ПриходныйОрдерНаТовары
	               |ГДЕ
	               |	ПриходныйОрдерНаТовары.ПометкаУдаления = ЛОЖЬ
	               |	И ПриходныйОрдерНаТовары.Проведен = ИСТИНА
	               |	И ТИПЗНАЧЕНИЯ(ПриходныйОрдерНаТовары.Распоряжение) = ТИП(Документ.ЗаказПоставщику)
	               |	И ПриходныйОрдерНаТовары.Распоряжение = &Ссылка";  
	Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.ДокументЗаказПоставщику.Ссылка);
	
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции
